//
//  main.swift
//  11-Task-MobilePhone
//
//  Created by user on 15.11.16.
//  Copyright © 2016 user. All rights reserved.
//

import Foundation

/* Задание: построить класс 1-го уровня с указанными в индивидуальном задании (табл. 11.7) полями и методами:
 - конструктор;
 - функция, которая определяет «качество» объекта – Q по заданной фор- муле (табл11. 7, столб 2);
 - вывод информации об объекте.
 Построить класс 2-го уровня (класс-потомок), который содержит:
 - дополнительное поле P;
 - функция, которая определяет «качество» объекта класса 2-го уровня – Qp, которая перекрывает функцию качества класса 1-го уровня (Q ), выполняя вычисление по новой формуле (табл. 11.7, столб 3).
 Создать проект для демонстрации работы: ввод и вывод информации об объектах классов 1-го и 2-го уровней.
 ---6---
 Мобильный телефон: - марка;
 - цена;
 - объем памяти.
 Q = объем памяти / цена
 -------
 P: количество SIM карт Qp = Q·Р   */

